tap "homebrew/bundle"
tap "homebrew/services"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy", restart_service: true
# Core application library for C
brew "glib"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Cross-platform make
brew "cmake"
# Containers for machine learning
brew "cog"
# General purpose TCP-IP emulator
brew "libslirp"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Development kit for the Java programming language
brew "openjdk"
# Display the PID number for a given process name
brew "pidof"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15"
# Persistent key-value database, with built-in net interface
brew "redis"
# Generate type safe Go from SQL
brew "sqlc"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Archive manager for data compression and backups
cask "rar"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Rust-based terminal
cask "warp"
mas "Asphalt 8", id: 610391947
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MacDroid", id: 1476545828
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
